app/views/super_heros/show.html.erb

SELECT "super_powers".* FROM "super_powers" WHERE "super_powers"."super_hero_id" = ?  [["super_hero_id", 1]]
---

<% @super_hero.super_powers.each do |sp| %>